Revit 2027 API
RectangleLightShape Constructor
 Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RectangleLightShape()
Public Sub New
public:
RectangleLightShape()
new : unit -> RectangleLightShape
See Also
Reference
RectangleLightShape Class
RectangleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace